// 说明：
// mapping.list.表名 可返回 mapping 对象数组
// 如 mapping.list.gender 结果返回:
// [{key:0, value:'女'},{key:1, value:'男'}]

// mapping 表
var mapping = {
	// 基金类型
    type: {
        1:'股票型',
        2:'固定收益型',
        3:'股债混合型',
    },
    gender: {
        1: '男',
        2: '女',
    },
    // 派息类型
    dividendType: {
        1:'每月派息',
        2:'每季度派息',
        3:'每半年派息',
        4:'每年派息',
        5:'非定期派息',
        6:'不派息',
    },
    // 基金币种
    currency: {
        1:'美元',
        2:'欧元',
        3:'澳元',
        4:'港元',
        5:'英镑',
        6:'人民币',
        7:'日元',
        8:'新加坡元',
        9:'瑞士法郎',
    },
    currencyName: {
        keys: ['USD','HKD','CNY','AUD','JPY','GBP','EUR','SGD','CHF'],
        USD: {
            'id': '1',
            'name': 'USD',
            'chinese_name': '美元'
        },
        EUR: {
            'id': '2',
            'name': 'EUR',
            'chinese_name': '欧元'
        },
        AUD: {
            'id': '3',
            'name': 'AUD',
            'chinese_name': '澳元'
        },
        HKD: {
            'id': '4',
            'name': 'HKD',
            'chinese_name': '港币'
        },
        GBP: {
            'id': '5',
            'name': 'GBP',
            'chinese_name': '英镑'
        },
        CNY: {
            'id': '6',
            'name': 'CNY',
            'chinese_name': '人民币'
        },
        JPY: {
            'id': '7',
            'name': 'JPY',
            'chinese_name': '日元'
        },
        SGD: {
            'id': '8',
            'name': 'SGD',
            'chinese_name': '新加坡元'
        },
        CHF: {
            'id': '9',
            'name': 'CHF',
            'chinese_name': '瑞士法郎'
        }
    },
    currencyCnName: {
        USD: '美元',
        EUR: '欧元',
        AUD: '澳元',
        HKD: '港币',
        GBP: '英镑',
        CNY: '人民币',
        JPY: '日元',
        SGD: '新加坡元',
        CHF: '瑞士法郎',
    },
    // 开户状态
    is_opener: {
        '0': '审核中',
        '1': '通过',
        '-1': '失败',
        '2': '未提交',
        '3': '审核中',
    },
    // 收益时间范围
    profit_time: {
        1: '近一日',
        2: '近一周',
        3: '近一月',
        4: '近一季',
        5: '近一年',
        6: '近三年',
        7: '近五年',
    },
    //排序标准
    all_profit_time:{
        1: '近一日',
        2: '近一周',
        3: '近一月',
        4: '近一季',
        5: '近一年',
        6: '近三年',
        7: '近五年',
        8: '近一日',
        9: '近一周',
        10: '近一月',
        11: '近一季',
        12: '近一年',
        13: '近三年',
        14: '近五年',
        15: '近一月',
        16: '近一月',
        17: '近一月',
        18: '近一月',
    },
    // 认购状态
    buyable: {
        0: '暂停认购',
        1: '可认购',
    },
    // 投资风格
    PSRPEquityStyleBoxLong: {
        1: {
            invest: '该基金主要投资于小盘-价值型的股票组合',
            focus: '主要关注小微市值，发展策略注重长远价值增长的企业股票'
        },
        2: {
            invest: '该基金主要投资于小盘-均衡型的股票组合',
            focus: '主要关注小微市值，注重价值与盈利均衡发展的企业股票'
        },
        3: {
            invest: '该基金主要投资于小盘-增长型的股票组合',
            focus: '主要关注小微市值，发展策略注重短期盈利的激进型企业股票'
        },
        4: {
            invest: '该基金主要投资于中盘-价值型的股票组合',
            focus: '主要关注中等市值，发展策略注重长远价值增长的企业股票'
        },
        5: {
            invest: '该基金主要投资于中盘-均衡型的股票组合',
            focus: '主要关注中等市值，注重价值与盈利均衡发展的企业股票'
        },
        6: {
            invest: '该基金主要投资于中盘-增长型的股票组合',
            focus: '主要关注中等市值，发展策略注重短期盈利的激进型企业股票'
        },
        7: {
            invest: '该基金主要投资于大盘-价值型的股票组合',
            focus: '主要关注较大市值，发展策略注重长远价值增长的企业股票'
        },
        8: {
            invest: '该基金主要投资于大盘-均衡型的股票组合',
            focus: '主要关注较大市值，注重价值与盈利均衡发展的企业股票'
        },
        9: {
            invest: '该基金主要投资于大盘-增长型的股票组合',
            focus: '主要关注较大市值，发展策略注重短期盈利的激进型企业股票'
        },
    },
    PSRPFixedIncStyleBoxLong: {
        1: {
            invest: '该基金主要投资于信用评级较低，利率敏感期较短的债券组合',
            focus: '主要关注拥有较低信用评级，对短期利率变动较为敏感的各类债券'
        },
        2: {
            invest: '该基金主要投资于信用评级较低，利率敏感期中等的债券组合',
            focus: '主要关注拥有较低信用评级，对中期利率变动较为敏感的各类债券'
        },
        3: {
            invest: '该基金主要投资于信用评级较低，利率敏感期较长的债券组合',
            focus: '主要关注拥有较低信用评级，对长期利率变动较为敏感的各类债券'
        },
        4: {
            invest: '该基金主要投资于信用评级中等，利率敏感期较短的债券组合',
            focus: '主要关注拥有中等信用评级，对短期利率变动较为敏感的各类债券'
        },
        5: {
            invest: '该基金主要投资于信用评级中等，利率敏感期中等的债券组合',
            focus: '主要关注拥有中等信用评级，对中期利率变动较为敏感的各类债券'
        },
        6: {
            invest: '该基金主要投资于信用评级中等，利率敏感期较长的债券组合',
            focus: '主要关注拥有中等信用评级，对长期利率变动较为敏感的各类债券'
        },
        7: {
            invest: '该基金主要投资于信用评级较高，利率敏感期较短的债券组合',
            focus: '主要关注拥有较高信用评级，对短期利率变动较为敏感的各类债券'
        },
        8: {
            invest: '该基金主要投资于信用评级较高，利率敏感期中等的债券组合',
            focus: '主要关注拥有较高信用评级，对中期利率变动较为敏感的各类债券'
        },
        9: {
            invest: '该基金主要投资于信用评级较高，利率敏感期较长的债券组合',
            focus: '主要关注拥有较高信用评级，对长期利率变动较为敏感的各类债券'
        },
    },
    card_type: {
        1: '大陆银行',
        2: '香港银行',
        3: '海外银行',
    },
    // 入金状态
    topop_state: {
        '-1' : '入金失败',
        '0': '审核中',
        '1': '入金成功',
        '2': '审核中',
    },
    // 兑换状态
    currency_state: {
        '-1' : '兑换失败',
        '0': '兑换中',
        '1': '兑换成功',
    },
    // 提现状态
    withdraw_state: {
        '-1' : '提现失败',
        '0': '提现中',
        '1': '提现成功',
    },
    // y邀请提现状态
    invite_withdraw_state: {
        '1' : '提现成功',
        '-1': '失败',
        '0': '审核中',
    },
    // 开户-公司商业性质
    business: {
        1: '会计师/法律服务',
        2: '银行/保险/金融',
        3: '顾问',
        4: '建筑/基建/地产',
        5: '传媒/出版/娱乐',
        6: '物流',
        7: '政府/公用事业/非营利',
        8: '资讯科技',
        9: '制造',
        10: '教育/培训',
        11: '酒店/旅游',
        12: '客户服务',
        13: '销售/市场推广/广告',
        14: '医疗/健康护理',
        15: '研究及发展',
        16: '零售/批发',
    },
    // 开户-年收入
    income: {
        1: '小于 ¥250,000',
        2: '¥250,000 – ¥749,999',
        3: '¥750,000 - ¥1,999,999',
        4: '¥2,000,000 – ¥4,999,999',
        5: '大于 ¥5,000,000',
    },
    // 开户-收入来源
    source: {
        1: '薪金',
        2: '业务利润',
        3: '投资收益',
        4: '遗产或礼物',
    },
    // 开户-流动资金(人民币)
    flow: {
        1: '小于 ¥250,000',
        2: '¥250,000 – ¥749,999',
        3: '¥750,000 - ¥1,999,999',
        4: '¥2,000,000 – ¥4,999,999',
        5: '大于 ¥5,000,000',
    },
    // 开户-风险偏好
    risk: {
        1: '保值',
        2: '增值',
        3: '收益',
        4: '投机',
    },
    // 开户-派息方式
    repay: {
        1: '再投资',
        2: '港币',
        3: '产品币种',
    },
    // 认购操作状态
    purchaseState: {
        '0': '认购中',
        '1': '认购成功',
        '-1': '认购失败',
    },
    // 赎回操作状态
    redeemState: {
        '0': '赎回中',
        '1': '赎回成功',
        '-1': '赎回失败',
    },
    // 交易记录操作类型
    recordType: {
        1: '认购',
        2: '赎回',
    },
    // 交易记录操作类型
    rate_state: {
        1: '审核中',
        2: '审核成功',
        3: '审核失败',
    }
}


// 生成 mapping 对象数组
var mappingList = {}
for(let atr in mapping) {
	let subObj = mapping[atr]
	let list = []
    if(subObj.keys) {
        for (var i = 0; i < subObj.keys.length; i++) {
            list.push(subObj[subObj.keys[i]])
        }
    }else {
    	// 遍历子对象
    	for(let atr2 in subObj) {
    		let obj = {}
    		obj.key = atr2
    		obj.value = subObj[atr2]
    		list.push(obj)
    	}
    }
	mappingList[atr] = list
}
mapping.list = mappingList


export default mapping
